blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Article"], ["body", "I love Ruby"], ["created_at", "2023-02-27 06:12:55.082545"], ["updated_at", "2023-02-27 06:12:55.082545"]]
---
  def create
    @article = Article.new(article_params)
    # debugger
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
---
  def destroy
    @article = Article.find(params[:id])
    debugger
    @article.destroy