blog/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commentor", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commentor", "dfsgdfxf"], ["body", "hfccgjhvbhjgghkj"], ["article_id", 1], ["created_at", "2023-02-27 12:23:57.111952"], ["updated_at", "2023-02-27 12:23:57.111952"], ["status", "public"]]
---
    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)